api/app/Controllers/Posts.php

SELECT *
FROM `tb_posts`
WHERE `excluded` = 0
ORDER BY `dth_insert` DESC
---
    public function list()
    {
        $response = [];

        try {

            $data = $this->postsModel->orderBy('dth_insert DESC')->where('excluded', 0)->findAll();